app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`Nombre`, `Apellido`, `Usuario`, `Email`, `pass`, `perfil_id`) VALUES ('Juan', 'Alberto', 'Admin', 'admin123@gmail.com', '$2y$10$I7zJUeoAanaa/XgF3AWIhO4ShjH.XJoMoWYtimn9Fy0coj2hGsvsW', 2)
---
                echo view('Front/end-view');

        } else {
            $formModel->save([
                'Nombre' => $this->request->getVar('nombre'),
                'Apellido'=> $this->request->getVar('apellido'),
                'Usuario'=> $this->request->getVar('usuario'),
                'Email'=> $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                'perfil_id' => 2,
              //password_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de único sentido.
            ]);