app/Controllers/Ventascontroller.php

    public function ventasUsuario()
    {
    $usuario_id = session()->get('id_usuario');

    $db = \Config\Database::connect();
    $detalleModel = new \App\Models\Ventas_detalle_model();


    $builder = $db->table('venta_cabecera vc');
    $builder->select('vc.*, u.Nombre as nombre_usuario, u.Apellido as apellido_usuario, u.Email as email_usuario');
    $builder->join('usuarios u', 'u.id_usuario = vc.usuario_id', 'inner');
    $builder->where('vc.usuario_id', $usuario_id);
    $ventas = $builder->get()->getResultArray();
---
SELECT `vc`.*, `u`.`Nombre` as `nombre_usuario`, `u`.`Apellido` as `apellido_usuario`, `u`.`Email` as `email_usuario`
FROM `venta_cabecera` `vc`
INNER JOIN `usuarios` `u` ON `u`.`id_usuario` = `vc`.`usuario_id`
WHERE `vc`.`usuario_id` = '7'