app/Models/Ventas_detalle_model.php

   public function obtenerDetallesPorVentaId($venta_id)
   {
    return $this->select('venta_detalle.*, producto.Nombre AS producto_nombre')
                ->join('producto', 'producto.ID_Pro = venta_detalle.producto_id')
                ->where('venta_detalle.venta_id', $venta_id)
                ->findAll();
---
SELECT `venta_detalle`.*, `producto`.`Nombre` AS `producto_nombre`
FROM `venta_detalle`
JOIN `producto` ON `producto`.`ID_Pro` = `venta_detalle`.`producto_id`
WHERE `venta_detalle`.`venta_id` = '86'